# BuiltInFailures.GeometryFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GeometryFailures Class
BuiltInFailures Class Members See Also
---
Failures about GeometryFailures.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class GeometryFailures
```

Visual Basic
---
```text
Public NotInheritable Class GeometryFailures
```

Visual C++
---
```text
public ref class GeometryFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..GeometryFailures
# See Also
BuiltInFailures..::..GeometryFailures Members
Autodesk.Revit.DB Namespace